app/Controllers/Inscricao.php

    public function cancelar($id)
    {
        $model = model(InscricaoModel::class);

        $model->delete($id);
---
DELETE FROM `inscricao`
WHERE `id` IN ('11')