app/Models/EventoModel.php

    public function mostraTodos()
    {
        return $this->findAll();
---
SELECT *
FROM `evento`